---
kind: method
id: M:Autodesk.Revit.DB.SchedulableField.Dispose
source: html/c483110b-50b4-7420-f1cf-afa6ee996dc1.htm
---
# Autodesk.Revit.DB.SchedulableField.Dispose Method

Releases all resources used by the SchedulableField

## Syntax (C#)
```csharp
public void Dispose()
```